In [1]:
import pandas as pd

In [3]:
index = 'a b c'.split()
index

['a', 'b', 'c']

In [4]:
columns = 'salesA salesB salesC'.split()
columns

['salesA', 'salesB', 'salesC']

In [6]:
data = [[123,312,567],[456,846,345],[554,566,734]]
data

[[123, 312, 567], [456, 846, 345], [554, 566, 734]]

In [8]:
df = pd.DataFrame(data, index, columns)
df

   salesA  salesB  salesC
a     123     312     567
b     456     846     345
c     554     566     734

In [10]:
condition = df >350
df[condition]

   salesA  salesB  salesC
a     NaN     NaN   567.0
b   456.0   846.0     NaN
c   554.0   566.0   734.0

In [11]:
condition = df['salesB'] > 600
df[condition]

   salesA  salesB  salesC
b     456     846     345

In [13]:
condition = (df['salesA'] > 400) & (df['salesB'] > 500) & (df['salesC'] < 400)
df[condition]

   salesA  salesB  salesC
b     456     846     345

In [15]:
df[df['salesA'] == 554]

   salesA  salesB  salesC
c     554     566     734

In [17]:
condition = df[['salesA','salesB','salesC']] > 500
df[condition]

   salesA  salesB  salesC
a     NaN     NaN   567.0
b     NaN   846.0     NaN
c   554.0   566.0   734.0